In [4]:
import pandas as pd

In [2]:
pip install pandas

Requirement already satisfied: pandas in /opt/conda/lib/python3.10/site-packages (1.5.2)
Requirement already satisfied: python-dateutil>=2.8.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2.8.2)
Requirement already satisfied: pytz>=2020.1 in /opt/conda/lib/python3.10/site-packages (from pandas) (2022.6)
Requirement already satisfied: numpy>=1.21.0 in /opt/conda/lib/python3.10/site-packages (from pandas) (1.23.5)
Requirement already satisfied: six>=1.5 in /opt/conda/lib/python3.10/site-packages (from python-dateutil>=2.8.1->pandas) (1.16.0)
Note: you may need to restart the kernel to use updated packages.

In [11]:
print("1Q. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series\nAns.")

1Q. Create a Pandas Series that contains the following data: 4, 8, 15, 16, 23, and 42. Then, print the series
Ans.

In [10]:
data = (4,8,15,16,23,42)
series = pd.Series(data)
print(series)

0     4
1     8
2    15
3    16
4    23
5    42
dtype: int64

In [18]:
print("Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable  print it.\nAns.")

Q2. Create a variable of list type containing 10 elements in it, and apply pandas.Series function on the variable  print it.
Ans.

In [30]:
list = [1,2,3,4]

In [31]:
variable = pd.Series(list)
print(variable)

0    1
1    2
2    3
3    4
dtype: int64

In [19]:
print("Q3. Create a Pandas DataFrame that contains the following data: , Then print the dataframe.\nAns.")

Q3. Create a Pandas DataFrame that contains the following data: , Then print the dataframe.
Ans.

In [1]:
dict = {"name":['Alice','Bob','Clarie'],"age":[25,30,27],"gender":['Male','Female','Male']}

In [5]:
df = pd.DataFrame(dict)

In [8]:
pip install lxml

Collecting lxml
  Downloading lxml-5.1.0-cp310-cp310-manylinux_2_17_x86_64.manylinux2014_x86_64.whl (8.0 MB)
     ━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━━ 8.0/8.0 MB 58.8 MB/s eta 0:00:0000:0100:01
Installing collected packages: lxml
Successfully installed lxml-5.1.0
Note: you may need to restart the kernel to use updated packages.

In [6]:
df

     name  age  gender
0   Alice   25    Male
1     Bob   30  Female
2  Clarie   27    Male

In [21]:
print("Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.\n\nAns.In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different data types. It can be thought of as a table or spreadsheet-like data structure, similar to a SQL table or an Excel spreadsheet. DataFrames are very versatile and can handle various types of data manipulation and analysis tasks.\n\nOn the other hand, a pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). It can be thought of as a single column of data in a DataFrame. Series objects also contain an index that labels each element in the array.")

Q4. What is ‘DataFrame’ in pandas and how is it different from pandas.series? Explain with an example.

Ans.In pandas, a DataFrame is a two-dimensional labeled data structure with columns of potentially different data types. It can be thought of as a table or spreadsheet-like data structure, similar to a SQL table or an Excel spreadsheet. DataFrames are very versatile and can handle various types of data manipulation and analysis tasks.

On the other hand, a pandas Series is a one-dimensional labeled array capable of holding data of any type (integer, string, float, python objects, etc.). It can be thought of as a single column of data in a DataFrame. Series objects also contain an index that labels each element in the array.

In [22]:
df= pd.DataFrame(dict)

In [23]:
df

     name  age  gender
0   Alice   25    Male
1     Bob   30  Female
2  Clarie   27    Male

In [28]:
data=[1,2,3]
age_only = pd.Series(data)

In [29]:
age_only

0    1
1    2
2    3
dtype: int64

In [33]:
print("Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?\n\nAns. We can use functions like: head to get the top 5 rows and tail to get the bottom 5 rows,info(): This function provides a concise summary of the DataFrame,describe(): This function computes summary statistics for numerical columns in the DataFrame, such as count, mean.")

Q5. What are some common functions you can use to manipulate data in a Pandas DataFrame? Can you give an example of when you might use one of these functions?

Ans. We can use functions like: head to get the top 5 rows and tail to get the bottom 5 rows,info(): This function provides a concise summary of the DataFrame,describe(): This function computes summary statistics for numerical columns in the DataFrame, such as count, mean.

In [34]:
url_data = pd.read_html("https://en.wikipedia.org/wiki/List_of_million-plus_urban_agglomerations_in_India")

In [35]:
df = url_data[0]

In [36]:
df

,Town/UA,State/UT,Pop. (2023)[8],Area (km2) (2011)[9],Pop. (2011)[7],Pop. (2001)[9],Pop. (1991)[9]
0,Delhi,"Delhi, Haryana, Rajasthan, Uttar Pradesh",31190000,1139.48,16314838,12877470,8419084.0
1,Mumbai,Maharashtra,25189000,1063.49,18394912,16434386,12596243.0
2,Kolkata,West Bengal,21747000,1056.13,14112536,13205697,11021918.0
3,Bangalore,Karnataka,15257000,748.42,8499399,5701446,4130288.0
4,Chennai,Tamil Nadu,11570000,932.47,8696010,6560242,5421985.0
...,...,...,...,...,...,...,...
60,Bhubaneswar,Odisha,1112000,92.91,219211,105491,38211.0
61,Jammu,Jammu and Kashmir,1103000,198.28,657314,612163,NaN
62,Solapur,Maharashtra,1082000,178.57,951558,872478,620846.0
63,Hubli-Dharwad,Karnataka,1062000,213.42,943788,786195,648298.0
64,Puducherry,Puducherry,1024000,77.26,401437,505959,657209.0

In [37]:
df.head()

,Town/UA,State/UT,Pop. (2023)[8],Area (km2) (2011)[9],Pop. (2011)[7],Pop. (2001)[9],Pop. (1991)[9]
0,Delhi,"Delhi, Haryana, Rajasthan, Uttar Pradesh",31190000,1139.48,16314838,12877470,8419084.0
1,Mumbai,Maharashtra,25189000,1063.49,18394912,16434386,12596243.0
2,Kolkata,West Bengal,21747000,1056.13,14112536,13205697,11021918.0
3,Bangalore,Karnataka,15257000,748.42,8499399,5701446,4130288.0
4,Chennai,Tamil Nadu,11570000,932.47,8696010,6560242,5421985.0

In [38]:
df.tail()

,Town/UA,State/UT,Pop. (2023)[8],Area (km2) (2011)[9],Pop. (2011)[7],Pop. (2001)[9],Pop. (1991)[9]
60,Bhubaneswar,Odisha,1112000,92.91,219211,105491,38211.0
61,Jammu,Jammu and Kashmir,1103000,198.28,657314,612163,NaN
62,Solapur,Maharashtra,1082000,178.57,951558,872478,620846.0
63,Hubli-Dharwad,Karnataka,1062000,213.42,943788,786195,648298.0
64,Puducherry,Puducherry,1024000,77.26,401437,505959,657209.0

In [39]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 65 entries, 0 to 64
Data columns (total 7 columns):
 #   Column                Non-Null Count  Dtype
---  ------                --------------  -----
 0   Town/UA               65 non-null     object
 1   State/UT              65 non-null     object
 2   Pop. (2023)[8]        65 non-null     int64
 3   Area (km2) (2011)[9]  65 non-null     float64
 4   Pop. (2011)[7]        65 non-null     int64
 5   Pop. (2001)[9]        65 non-null     int64
 6   Pop. (1991)[9]        63 non-null     float64
dtypes: float64(2), int64(3), object(2)
memory usage: 3.7+ KB

In [40]:
df.describe()

,Pop. (2023)[8],Area (km2) (2011)[9],Pop. (2011)[7],Pop. (2001)[9],Pop. (1991)[9]
count,6.500000e+01,65.000000,6.500000e+01,6.500000e+01,6.300000e+01
mean,3.757585e+06,376.893077,2.577409e+06,1.980011e+06,1.513187e+06
std,5.636886e+06,324.002176,3.523286e+06,3.007942e+06,2.316453e+06
min,1.024000e+06,44.930000,2.192110e+05,1.054910e+05,0.000000e+00
25%,1.345000e+06,148.120000,1.021717e+06,7.579790e+05,5.885255e+05
50%,1.720000e+06,229.200000,1.390933e+06,1.003919e+06,8.011900e+05
75%,3.049000e+06,502.780000,2.046652e+06,1.461139e+06,1.100373e+06
max,3.119000e+07,1225.590000,1.839491e+07,1.643439e+07,1.259624e+07

In [41]:
df.columns

Index(['Town/UA', 'State/UT', 'Pop. (2023)[8]', 'Area (km2) (2011)[9]',
       'Pop. (2011)[7]', 'Pop. (2001)[9]', 'Pop. (1991)[9]'],
      dtype='object')

In [44]:
df.dtypes

Town/UA                  object
State/UT                 object
Pop. (2023)[8]            int64
Area (km2) (2011)[9]    float64
Pop. (2011)[7]            int64
Pop. (2001)[9]            int64
Pop. (1991)[9]          float64
dtype: object

In [45]:
print("Q6. Which of the following is mutable in nature Series, DataFrame, Panel?\n\nAns.Among the three data structures Series, DataFrame, and Panel in pandas, only the DataFrame is mutable in nature.\n\nSeries: Series is one-dimensional and immutable. Once created, you cannot modify the elements of a Series directly. However, you can create a new Series with modified elements.\n\nDataFrame: DataFrame is two-dimensional and mutable. You can modify the contents of a DataFrame, including adding or removing rows and columns, changing values, etc.\n\nPanel: Panel is a three-dimensional data structure, which is considered less commonly used compared to Series and DataFrame. However, like Series, Panel is also immutable. Once created, you cannot modify the elements of a Panel directly. Similar to Series, you would need to create a new Panel with modified elements.")

Q6. Which of the following is mutable in nature Series, DataFrame, Panel?

Ans.Among the three data structures Series, DataFrame, and Panel in pandas, only the DataFrame is mutable in nature.

Series: Series is one-dimensional and immutable. Once created, you cannot modify the elements of a Series directly. However, you can create a new Series with modified elements.

DataFrame: DataFrame is two-dimensional and mutable. You can modify the contents of a DataFrame, including adding or removing rows and columns, changing values, etc.

Panel: Panel is a three-dimensional data structure, which is considered less commonly used compared to Series and DataFrame. However, like Series, Panel is also immutable. Once created, you cannot modify the elements of a Panel directly. Similar to Series, you would need to create a new Panel with modified elements.

In [46]:
print("Q7. Create a DataFrame using multiple Series. Explain with an example.\n\nAns.As given below:")

Q7. Create a DataFrame using multiple Series. Explain with an example.

Ans.As given below:

In [47]:
name_series = pd.Series(['Alice', 'Bob', 'Charlie'])
age_series = pd.Series([25, 30, 35])
gender_series = pd.Series(['Female', 'Male', 'Male'])

# Creating a DataFrame using multiple Series
df = pd.DataFrame({'Name': name_series, 'Age': age_series, 'Gender': gender_series})

# Displaying the DataFrame
print("DataFrame:")
print(df)

DataFrame:
      Name  Age  Gender
0    Alice   25  Female
1      Bob   30    Male
2  Charlie   35    Male